Catalogs/ЛБ_СценарииОценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_СценарииОценки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id_LX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазовыеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяПроба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппыПроб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеОтБазовойПоУмолчанию</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазоваяЦенаПоЗапросу</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценкаПоБазовойКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияОбъектаЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппыПроб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОклонениеОтБазовой</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОкругления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкруглятьВБольшуюСторону</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаОтклоненийОтБазовыхЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияОбъектаЗалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаКредитования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Металл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_ГруппыПроб</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтклонениеОтБазовойЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЛБ_ОтклонениеОтБазовойЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеОтклонения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_ГруппыПроб.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ГруппыПроб</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Металл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеМеталлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пробы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Проба</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_СценарииОценки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		Объект.Дата = ТекущаяДата();
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	ИначеЕсли ПроверитьИспользованиеСценария() Тогда                                
		ЭтаФорма.ТолькоПросмотр = Истина;  
		Элементы.ДекорацияПредупреждение.Видимость = Истина;
	КонецЕсли;	
КонецПроцедуры	 

&НаСервере
Функция ПроверитьИспользованиеСценария()
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЛБ_ПриказУсловияПредоставленияЗаймов КАК ЛБ_ПриказУсловияПредоставленияЗаймов
	               |ГДЕ
	               |	ЛБ_ПриказУсловияПредоставленияЗаймов.Проведен = ИСТИНА
	               |	И ЛБ_ПриказУсловияПредоставленияЗаймов.СценарийОценкиМеталлов = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ЗаполнитьПробыПоБазовой(Идентификатор) 
	СтрокаТабличнойЧастиНастройки = Объект.БазовыеНастройки.НайтиПоИдентификатору(Идентификатор);
	Если СтрокаТабличнойЧастиНастройки = неопределено Тогда
		Возврат;
	КонецЕсли;
	ЕстьОшибкиЗаполнения = ложь;
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.Металл) Тогда
		Сообщить("Строка № " + Строка(СтрокаТабличнойЧастиНастройки.НомерСтроки) + ": Не выбран металл!");
		ЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.БазоваяКатегория) Тогда
		Сообщить("Строка № " + Строка(СтрокаТабличнойЧастиНастройки.НомерСтроки) + ": Не определена базовая категория объектов залога!");
		ЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.БазоваяПроба) Тогда
		Сообщить("Строка № " + Строка(СтрокаТабличнойЧастиНастройки.НомерСтроки) + ":Не определена базовая проба (группа проб)!");
		ЕстьОшибкиЗаполнения = Истина;
	КонецЕсли;	 
	Если ЕстьОшибкиЗаполнения Тогда
		Возврат;
	КонецЕсли;	   
	
	ОтборК = Новый Структура;
	ОтборК.Вставить("КлючСтроки", СтрокаТабличнойЧастиНастройки.КлючСтроки);
	СтрокиК = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(ОтборК);
	Для каждого стрК из СтрокиК Цикл 
		Объект.ОценкаПоБазовойКатегории.Удалить(СтрК);
	КонецЦикла;	
	
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("БазоваяКатегория", СтрокаТабличнойЧастиНастройки.БазоваяКатегория);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_КатегорииОбъектовЗалога.Ссылка КАК Категория
	               |ИЗ
	               |	Справочник.ЛБ_КатегорииОбъектовЗалога КАК ЛБ_КатегорииОбъектовЗалога
	               |ГДЕ
	               |	ЛБ_КатегорииОбъектовЗалога.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	ТаблицаКатегорий = Запрос.Выполнить().Выгрузить();
	
	Запрос.УстановитьПараметр("Металл", СтрокаТабличнойЧастиНастройки.Металл);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыПроб.Ссылка КАК Проба
	               |ИЗ
	               |	Справочник.ЛБ_ГруппыПроб КАК ЛБ_ГруппыПроб
	               |ГДЕ
	               |	ЛБ_ГруппыПроб.Металл = &Металл
	               |	И ЛБ_ГруппыПроб.ПометкаУдаления = ЛОЖЬ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		 //Отбор = Новый Структура;
		 //Отбор.Вставить("Проба", Выборка.Проба);
		 //Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
		 //Если Строки.Количество() = 0 Тогда
		 Для каждого СтрК Из ТаблицаКатегорий Цикл   				 
			 НоваяСтр = Объект.ОценкаПоБазовойКатегории.Добавить();
			 НоваяСтр.КлючСтроки = СтрокаТабличнойЧастиНастройки.КлючСтроки;
			 НоваяСтр.КатегорияОбъектаЗалога = СтрК.Категория;
			 НоваяСтр.Металл = СтрокаТабличнойЧастиНастройки.Металл;
			 НоваяСтр.Проба = Выборка.Проба; 
			 НоваяСтр.ОклонениеОтБазовой = СтрокаТабличнойЧастиНастройки.ОтклонениеОтБазовойПоУмолчанию;
			 НоваяСтр.ПорядокОкругления = СтрокаТабличнойЧастиНастройки.ПорядокОкругления;
			 НоваяСтр.ОкруглятьВБольшуюСторону = СтрокаТабличнойЧастиНастройки.ОкруглятьВБольшуюСторону;
		 Конеццикла;	 
		 //КонецЕсли;	 
	 КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗаполнитьПоБазовой(Команда) 
	СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	Если СтрокаТабличнойЧастиНастройки = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.Металл) ИЛИ 
		   НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.БазоваяПроба) ИЛИ
		     НЕ ЗначениеЗаполнено(СтрокаТабличнойЧастиНастройки.БазоваяКатегория) Тогда
		Сообщить("Перед заполнением в верхней таблице должны быть выбраны металл, базовая проба и базовая категория!", СтатусСообщения.Информация);	 
	КонецЕсли;	

	ЗаполнитьПробыПоБазовой(СтрокаТабличнойЧастиНастройки.ПолучитьИдентификатор()); 
		
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиНастройки.КлючСтроки);
	Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
КонецПроцедуры


&НаКлиенте
Процедура БазовыеНастройкиПриАктивизацииСтроки(Элемент)
	СтрокаТабличнойЧасти = Элементы.БазовыеНастройки.ТекущиеДанные;	
	
	Если СтрокаТабличнойЧасти <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧасти.КлючСтроки);
		Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);		
		Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОценкаВБазовойКатегорииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	    СтрокаТабличнойЧасти       = Элементы.ОценкаПоБазовойКатегории.ТекущиеДанные;
	
	    СтрокаТабличнойЧасти.КлючСтроки = СтрокаТабличнойЧастиНастройки.КлючСтроки;
		СтрокаТабличнойЧасти.ОклонениеОтБазовой = СтрокаТабличнойЧастиНастройки.ОтклонениеОтБазовойПоУмолчанию;
		СтрокаТабличнойЧасти.ПорядокОкругления = СтрокаТабличнойЧастиНастройки.ПорядокОкругления;
		СтрокаТабличнойЧасти.ОкруглятьВБольшуюСторону = СтрокаТабличнойЧастиНастройки.ОкруглятьВБольшуюСторону;
     КонецЕсли;	

КонецПроцедуры

&НаСервере
Функция ПолучитьКлючСтроки()
	Возврат ЛБ_ОбщийМодуль.ПолучитьКлючСтроки(Объект, "БазовыеНастройки");
КонецФункции	

&НаКлиенте
Процедура БазовыеНастройкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧасти = Элементы.БазовыеНастройки.ТекущиеДанные;
		СтрокаТабличнойЧасти.КлючСтроки = ПолучитьКлючСтроки(); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОценкаПоБазовойКатегорииПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	Если СтрокаТабличнойЧастиНастройки <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиНастройки.КлючСтроки);
		Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура БазовыеНастройкиПередУдалением(Элемент, Отказ)
	СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	
	Если СтрокаТабличнойЧастиНастройки <> Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", СтрокаТабличнойЧастиНастройки.КлючСтроки);
		
		НайденныеСтроки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
		
		Для каждого Строка Из НайденныеСтроки Цикл
			Объект.ОценкаПоБазовойКатегории.Удалить(Строка);	
		КонецЦикла; 
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ОценкаПоБазовойКатегорииПослеУдаления(Элемент)
	СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	Если СтрокаТабличнойЧастиНастройки <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиНастройки.КлючСтроки);
		Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.ОценкаПоБазовойКатегории.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОценкаПоБазовойКатегорииЗначениеОтклоненияПриИзменении(Элемент)
	// проверим что для  базовой пробы и базовой категории отклонение = 0
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтклонение(Команда)     
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("Вид", 0);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтклонения", ЭтаФорма);
	ОткрытьФорму("Справочник.ЛБ_СценарииОценки.Форма.ФормаЗаполненияОтклонения", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОтклонения(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;      
	
	Отбор = Новый Структура; 
	Если ЗначениеЗаполнено(Результат.Металл) Тогда
	    Отбор.Вставить("Металл", Результат.Металл);
    КонецЕсли;  
	Если ЗначениеЗаполнено(Результат.Проба) Тогда
	    Отбор.Вставить("Проба", Результат.Проба);
    КонецЕсли;  
    Если ЗначениеЗаполнено(Результат.Категория) Тогда
	   Отбор.Вставить("КатегорияОбъектаЗалога", Результат.Категория);
    КонецЕсли;    
    Если Отбор.Количество() = 0 Тогда	
		Для каждого Стр Из Объект.ОценкаПоБазовойКатегории Цикл
			ОтборБ = Новый Структура;
			ОтборБ.Вставить("БазоваяПроба", Стр.Проба); 
			ОтборБ.Вставить("БазоваяКатегория", Стр.КатегорияОбъектаЗалога); 
			СтрокиБ = Объект.БазовыеНастройки.НайтиСтроки(ОтборБ);
			Если НЕ СтрокиБ.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;	
			Стр.ЗначениеОтклонения = Результат.Отклонение;
		КонецЦикла;	
    Иначе
	   Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
	   Для каждого Стр Из Строки Цикл	
		   ОтборБ = Новый Структура;
		   ОтборБ.Вставить("БазоваяПроба", Стр.Проба); 
		   ОтборБ.Вставить("БазоваяКатегория", Стр.КатегорияОбъектаЗалога); 
		   СтрокиБ = Объект.БазовыеНастройки.НайтиСтроки(ОтборБ);
	       Если НЕ СтрокиБ.Количество() = 0 Тогда
			   Продолжить;
		   КонецЕсли;	
		   Стр.ЗначениеОтклонения = Результат.Отклонение;		   
	   КонецЦикла;	
	КонецЕсли;   
КонецПроцедуры


&НаКлиенте
Процедура БазовыеНастройкиБазоваяЦенаПоЗапросуПриИзменении(Элемент)
	ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
	Если ТекСтрока.БазоваяЦенаПоЗапросу Тогда
		ТекСтрока.БазоваяЦена = 0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ВсеОК = Истина;
	Для каждого стр Из Объект.БазовыеНастройки Цикл 
		Если НЕ Стр.БазоваяЦенаПоЗапросу И (Стр.БазоваяЦена = 0) Тогда   
			ВсеОК = Ложь;
		КонецЕсли;	
	КонецЦикла;   
	Если НЕ ВсеОк Тогда
	    Сообщить("Ошибка заполнения таблицы базовых настроек. Если не выбрано значение базовой цены по запросу, то базовая цена должна быть заполнена!");    
	    Отказ = Истина;
	КонецЕсли;  
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	ВсеОк = Истина;
	Для каждого стрБ Из Объект.БазовыеНастройки Цикл 
		Отбор = Новый структура;
		Отбор.Вставить("КлючСтроки", СтрБ.КлючСтроки); 
		
		НачалоСообщения = "Ошибки заполнения настроек (" + СокрЛП(СтрБ.Металл) + "): есть незаполненные значения";
		Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
		БезОшибокПроба = Истина;  
		БезОшибокКатегория = Истина;  
		БезОшибокОтклонение = Истина;
		Для каждого Стр Из Строки Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Проба)Тогда
				БезОшибокПроба = Ложь;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Стр.КатегорияОбъектаЗалога) Тогда
				БезОшибокКатегория = Ложь;
			КонецЕсли;	
            Если НЕ ЗначениеЗаполнено(Стр.ОклонениеОтБазовой) Тогда
				БезОшибокОтклонение = Ложь;
			КонецЕсли;	
		Конеццикла; 
		
		Если НЕ БезОшибокПроба ИЛИ НЕ БезОшибокКатегория ИЛИ НЕ БезОшибокОтклонение Тогда  
			ТекстСообщения = НачалоСообщения; 
			Ном = 0;
			Если НЕ БезОшибокПроба Тогда 
				ТекстСообщения = ТекстСообщения + ?(Ном = 0, " ", ", ") + "пробы металла"; 
				Ном = Ном + 1;
			КонецЕсли;	
			Если НЕ БезОшибокКатегория Тогда 
				ТекстСообщения = ТекстСообщения + ?(Ном = 0, " ", ", ") + "категории объекта залога"; 
				Ном = Ном + 1;
			КонецЕсли;	
			Если НЕ БезОшибокОтклонение Тогда 
				ТекстСообщения = ТекстСообщения + ?(Ном = 0, " ", ", ") + "отклонения"; 
				Ном = Ном + 1;
			КонецЕсли;	
			Сообщить(ТекстСообщения + ".");
			ВсеОК = Ложь;
   		КонецЕсли;	
	Конеццикла;	 
	
	Если НЕ ВсеОк Тогда  
	    Отказ = Истина;
	КонецЕсли;  
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьНастройкиОтклонения(Команда)
	Если Объект.ОценкаПоБазовойКатегории.Количество() = 0 Тогда
		Предупреждение("Необходимо сначала заполнить основную таблицу сценария.", 60);
		Возврат;
	КонецЕсли;	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораНастройки", ЭтаФорма);
	ОткрытьФорму("Справочник.ЛБ_СценарииОценки.Форма.ФормаЗаполненияНастроекОтклонения", , ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры    

&НаКлиенте
Процедура ПослеВыбораНастройки(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	ЗаполнитьНастройкиОтклоненийНаСервере(Результат.ТаблицаСК);
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНастройкиОтклоненийНаСервере(ТаблицаСК)  
	Для каждого СтрК Из ТаблицаСК Цикл 
		ОтборК = Новый Структура;
		ОтборК.Вставить("СхемаКредитования", СтрК.СхемаКредитования);
		Если ЗначениеЗаполнено(СтрК.Металл) Тогда
		    ОтборК.Вставить("Металл", СтрК.Металл);  
		КонецЕсли;	
		Если ЗначениеЗаполнено(СтрК.Категория) Тогда
		    ОтборК.Вставить("КатегорияОбъектаЗалога", СтрК.Категория);  
		КонецЕсли;	
		СтрокиК = Объект.НастройкаОтклоненийОтБазовыхЦен.НайтиСтроки(ОтборК);
		Для каждого СтрКК Из СтрокиК Цикл 
			Объект.НастройкаОтклоненийОтБазовыхЦен.Удалить(СтрКК);
		Конеццикла;	   
		Отбор = Новый Структура;
        Если ЗначениеЗаполнено(СтрК.Металл) Тогда
		    Отбор.Вставить("Металл", СтрК.Металл);  
		КонецЕсли;	
		Если ЗначениеЗаполнено(СтрК.Категория) Тогда
		    Отбор.Вставить("КатегорияОбъектаЗалога", СтрК.Категория);  
		КонецЕсли;	
        Если Отбор.Количество() = 0 Тогда
			Для каждого стр Из Объект.ОценкаПоБазовойКатегории Цикл  
				НоваяСтр = Объект.НастройкаОтклоненийОтБазовыхЦен.Добавить(); 
				НоваяСтр.КлючСтроки = Стр.КлючСтроки;
				НоваяСтр.СхемаКредитования = СтрК.СхемаКредитования;  
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога; 
				НоваяСтр.Металл = Стр.Металл; 
				НоваяСтр.Проба = Стр.Проба; 
				НоваяСтр.ОтклонениеОтБазовойЦены = СтрК.Отклонение;
				НоваяСтр.ЗначениеОтклонения = СтрК.ЗначениеОтклонения;
			Конеццикла;	  
		Иначе                         
			Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор);
			Для каждого стр Из Строки Цикл  
				НоваяСтр = Объект.НастройкаОтклоненийОтБазовыхЦен.Добавить(); 
				НоваяСтр.КлючСтроки = Стр.КлючСтроки;
				НоваяСтр.СхемаКредитования = СтрК.СхемаКредитования;  
				НоваяСтр.КатегорияОбъектаЗалога = Стр.КатегорияОбъектаЗалога; 
				НоваяСтр.Металл = Стр.Металл; 
				НоваяСтр.Проба = Стр.Проба; 
				НоваяСтр.ОтклонениеОтБазовойЦены = СтрК.Отклонение;
				НоваяСтр.ЗначениеОтклонения = СтрК.ЗначениеОтклонения;
			Конеццикла;	  
		КонецЕсли;	
	КонецЦикла;		
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьОтклонениеН(Команда)
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("Вид", 1);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораОтклоненияН", ЭтаФорма);
	ОткрытьФорму("Справочник.ЛБ_СценарииОценки.Форма.ФормаЗаполненияОтклонения", ПараметрыФормы, ЭтаФорма,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры    

&НаКлиенте
Процедура ПослеВыбораОтклоненияН(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;      
	
	Отбор = Новый Структура; 
	Если ЗначениеЗаполнено(Результат.СхемаКредитования) Тогда
	    Отбор.Вставить("СхемаКредитования", Результат.СхемаКредитования);
    КонецЕсли;    
    Если ЗначениеЗаполнено(Результат.Металл) Тогда
	    Отбор.Вставить("Металл", Результат.Металл);
    КонецЕсли; 
	Если ЗначениеЗаполнено(Результат.Проба) Тогда
	    Отбор.Вставить("Проба", Результат.Проба);
    КонецЕсли;  
    Если ЗначениеЗаполнено(Результат.Категория) Тогда
	   Отбор.Вставить("КатегорияОбъектаЗалога", Результат.Категория);
    КонецЕсли;    
    Если Отбор.Количество() = 0 Тогда	
		Для каждого Стр Из Объект.НастройкаОтклоненийОтБазовыхЦен Цикл 
			Стр.ЗначениеОтклонения = Результат.Отклонение;
		КонецЦикла;	
    Иначе
	   Строки = Объект.НастройкаОтклоненийОтБазовыхЦен.НайтиСтроки(Отбор);
	   Для каждого Стр Из Строки Цикл	   
		   Стр.ЗначениеОтклонения = Результат.Отклонение;		   
	   КонецЦикла;	
	КонецЕсли;   
КонецПроцедуры


&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		СтрокаТабличнойЧастиНастройки = Элементы.БазовыеНастройки.ТекущиеДанные;
	    СтрокаТабличнойЧасти       = Элементы.НастройкаОтклоненийОтБазовыхЦен.ТекущиеДанные;
	
	    СтрокаТабличнойЧасти.КлючСтроки = СтрокаТабличнойЧастиНастройки.КлючСтроки;
     КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаОтклоненийОтБазовыхЦенПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	СтрокаТабличнойЧастиНастройки = Элементы.НастройкаОтклоненийОтБазовыхЦен.ТекущиеДанные;
	Если СтрокаТабличнойЧастиНастройки <> неопределено Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",СтрокаТабличнойЧастиНастройки.КлючСтроки);
		Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки",0);
		Элементы.НастройкаОтклоненийОтБазовыхЦен.ОтборСтрок = НОвый ФиксированнаяСтруктура(Отбор);
		
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура БазовыеНастройкиОтклонениеОтБазовойПоУмолчаниюПриИзменении(Элемент)
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОтклонение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Заполнить отклонение от базовой цены в нижней таблице выбранным значением?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, );
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтветаНаВопросОтклонение(Результат, Параметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
		НовоеОтклонение = ТекСтрока.ОтклонениеОтБазовойПоУмолчанию;
		КлючСтроки = ТекСтрока.КлючСтроки;
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", КлючСтроки);
		Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
		
		Для каждого Стр Из строки Цикл 
			Стр.ОклонениеОтБазовой = НовоеОтклонение;
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура БазовыеНастройкиПорядокОкругленияПриИзменении(Элемент)
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОкругление", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Заполнить порядок округления в нижней таблице выбранным значением?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, );
КонецПроцедуры    

&НаКлиенте
Процедура ПослеОтветаНаВопросОкругление(Результат, Параметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
		НовоеОкругление = ТекСтрока.ПорядокОкругления;
		КлючСтроки = ТекСтрока.КлючСтроки;
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", КлючСтроки);
		Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
		
		Для каждого Стр Из строки Цикл 
			Стр.ПорядокОкругления = НовоеОкругление;
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры	


&НаКлиенте
Процедура БазовыеНастройкиОкруглятьВБольшуюСторонуПриИзменении(Элемент)
	Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОкруглениеВБольшуюСторону", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, "Заполнить метод округления в нижней таблице выбранным значением?",  РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да, );
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОкруглениеВБольшуюСторону(Результат, Параметры) Экспорт  
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ТекСтрока = Элементы.БазовыеНастройки.ТекущиеДанные;
		НовоеОкруглениеВБольшуюСторону = ТекСтрока.ОкруглятьВБольшуюСторону;
		КлючСтроки = ТекСтрока.КлючСтроки;
		
		Отбор = Новый Структура;
		Отбор.Вставить("КлючСтроки", КлючСтроки);
		Строки = Объект.ОценкаПоБазовойКатегории.НайтиСтроки(Отбор); 
		
		Для каждого Стр Из строки Цикл 
			Стр.ОкруглятьВБольшуюСторону = НовоеОкруглениеВБольшуюСторону;
		Конеццикла;	
	КонецЕсли;	
КонецПроцедуры
